Revit 2024 API
IFCExtrusionCalculatorUtils Members
Methods
Name | Description
CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject)
 Calculates the extrusion data from a Revit geometry object.
CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList<Face>)
See Also
IFCExtrusionCalculatorUtils Class
Autodesk.Revit.DB.IFC Namespace